#include "audio_files.h"

const char* searchWords[] = {
    "صفر", "یک", "دو", "سه", "چهار", "پنج", "شش", "هفت", "هشت", "نه",
    "ده", "یازده", "دوازده", "سیزده", "چهارده", "پانزده", "شانزده", "هفده", "هجده", "نوزده",
    "بیست", "سی", "چهل", "پنجاه", "شصت", "هفتاد", "هشتاد", "نود",
    "بیستو", "سیو", "چهلو", "پنجاهو", "شصتو", "هفتادو", "هشتادو", "نودو",
    "صد", "دویست", "سیصد", "چهارصد", "پانصد", "ششصد", "هفتصد", "هشتصد", "نهصد", 
    "صدو", "دویستو", "سیصدو", "چهارصدو", "پانصدو", "ششصدو", "هفتصدو", "هشتصدو", "نهصدو", 
    "هزار", "میلیون", "میلیارد", "هزارو", "میلیونو", "میلیاردو", 
};

const char* alternativeWords[] = {
    "./0-10/0.mp3", "./0-10/1.mp3", "./0-10/2.mp3", "./0-10/3.mp3", "./0-10/4.mp3", "./0-10/5.mp3", "./0-10/6.mp3", "./0-10/7.mp3", "./0-10/8.mp3", "./0-10/9.mp3",
    "./10-100/10.mp3", "./11-20/11.mp3", "./11-20/12.mp3", "./11-20/13.mp3", "./11-20/14.mp3", "./11-20/15.mp3", "./11-20/16.mp3", "./11-20/17.mp3", "./11-20/18.mp3", "./11-20/19.mp3",
    "./11-20/20.mp3", "./10-100/30.mp3", "./10-100/40.mp3", "./10-100/50.mp3", "./10-100/60.mp3", "./10-100/70.mp3", "./10-100/80.mp3", "./10-100/90.mp3",
    "./20o-100o/20_.mp3", "./20o-100o/30_.mp3", "./20o-100o/40_.mp3", "./20o-100o/50_.mp3", "./20o-100o/60_.mp3", "./20o-100o/70_.mp3", "./20o-100o/80_.mp3", "./20o-100o/90_.mp3",
    "./10-100/100.mp3", "./200-1000/200.mp3", "./200-1000/300.mp3", "./200-1000/400.mp3", "./200-1000/500.mp3", "./200-1000/600.mp3", "./200-1000/700.mp3", "./200-1000/800.mp3", "./200-1000/900.mp3", 
    "./100o-1000o/100_.mp3", "./100o-1000o/200_.mp3", "./100o-1000o/300_.mp3", "./100o-1000o/400_.mp3", "./100o-1000o/500_.mp3", "./100o-1000o/600_.mp3", "./100o-1000o/700_.mp3", "./100o-1000o/800_.mp3", "./100o-1000o/900_.mp3", 
    "./new/1000.mp3", "./new/milion.mp3", "./new/miliard.mp3", "./new/1000_.mp3", "./new/milion_.mp3", "./new/miliard_.mp3",
};

const int numWords = sizeof(searchWords) / sizeof(searchWords[0]);